app/views/breweries/show.html.erb

SELECT "beers".* FROM "beers" WHERE "beers"."brewery_id" = ?  [["brewery_id", 2]]
SELECT COUNT(*) FROM "beers" WHERE "beers"."brewery_id" = ?  [["brewery_id", 1]]
---

<p> Amount of beers: <%= @brewery.beers.count %></p>