app/controllers/beers_controller.rb

  def edit
    @breweries = Brewery.all
---
SELECT "breweries".* FROM "breweries"

  def create
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save
---
INSERT INTO "beers" ("name", "style_id", "brewery_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Karjala III"], ["style_id", 1], ["brewery_id", 2], ["created_at", "2015-02-22 16:57:48.757866"], ["updated_at", "2015-02-22 16:57:48.757866"]]

    def set_breweries_and_styles_for_template
      @breweries = Brewery.all
      @styles = Style.all
---
SELECT "breweries".* FROM "breweries"
SELECT "styles".* FROM "styles"