app/controllers/ratings_controller.rb

  def create
    raise
    Rating.create params.require(:rating).permit(:score, :beer_id)
---
INSERT INTO "ratings" ("score", "beer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["score", 3], ["beer_id", 3], ["created_at", "2015-01-25 16:45:24.568188"], ["updated_at", "2015-01-25 16:45:24.568188"]]